app/controllers/admin/post_images_controller.rb

  def index
    @post_images = PostImage.page(params[:page]).reverse_order
    @post_image = PostImage.new
    @tag_list = Tag.all
---
SELECT  "post_images".* FROM "post_images" ORDER BY "post_images"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT "tags".* FROM "tags"

  def show
    @post_image = PostImage.find(params[:id])
---
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def edit
    @post_image = PostImage.find(params[:id])
---
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

   def update
     @post_image = PostImage.find(params[:id])
    if @post_image.update(post_image_params)
---
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "post_images" SET "image_id" = ?, "description" = ?, "updated_at" = ? WHERE "post_images"."id" = ?  [["image_id", "58fe022beb1998fc0deda1760b0543f6d546c613a59dbb81ec29842fcfe7"], ["description", "管理者が不正な文字を発見した為編集しました"], ["updated_at", "2021-05-22 12:20:05.166549"], ["id", 2]]

  def destroy
    @post_image = PostImage.find(params[:id])
---
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]