app/models/post_image.rb

   def save_tag(sent_tags)
    current_tags = self.tags.pluck(:tag_name) unless self.tags.nil?
    old_tags = current_tags - sent_tags
    new_tags = sent_tags - current_tags

    old_tags.each do |old|
      self.post_image_tags.delete Tag.find_by(tag_name: old)
    end

    new_tags.each do |new|
      new_post_image_tag = Tag.find_or_create_by(tag_name: new)
---
SELECT "tags"."tag_name" FROM "tags" INNER JOIN "tag_maps" ON "tags"."id" = "tag_maps"."tag_id" WHERE "tag_maps"."post_image_id" = ?  [["post_image_id", 1]]
INSERT INTO "tags" ("tag_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["tag_name", "憧れの車両　スーパーカー"], ["created_at", "2021-05-15 05:39:43.773199"], ["updated_at", "2021-05-15 05:39:43.773199"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."tag_name" = ? LIMIT ?  [["tag_name", "憧れの車両　スーパーカー"], ["LIMIT", 1]]