app/controllers/users/post_images_controller.rb

  def create
    @post_image = PostImage.new(post_image_params)
    @post_image.user_id = current_user.id
    tag_list = params[:post_image][:tag_name].split(nil)
    if @post_image.save
       @post_image.save_tag(tag_list)
---
INSERT INTO "post_images" ("title", "description", "image_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "tags" ("tag_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["tag_name", "憧れの車両　スーパーカー"], ["created_at", "2021-05-15 05:39:43.773199"], ["updated_at", "2021-05-15 05:39:43.773199"]]

  def show
    @post_image = PostImage.find(params[:id]) #クリックした投稿を習得
---
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @post_images = PostImage.page(params[:page]).reverse_order
    @post_image = PostImage.new
    @tag_list = Tag.all                          #ビューでタグ一覧を表示するために全取得。
---
SELECT  "post_images".* FROM "post_images" ORDER BY "post_images"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT "tags".* FROM "tags"

  def edit
     @post_image = PostImage.find(params[:id])
---
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

   def update
    if @post_image.update(post_image_params)
---
UPDATE "post_images" SET "image_id" = ?, "updated_at" = ? WHERE "post_images"."id" = ?  [["image_id", "1bcbbdc3e9e512ca9c0fed41fd8384cc616324e135e9ade9965c79d2bd6b"], ["updated_at", "2021-05-18 07:06:10.609334"], ["id", 11]]

  def destroy
    @post_image = PostImage.find(params[:id])
    @post_image.destroy
---
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "post_images" WHERE "post_images"."id" = ?  [["id", 5]]

  def ensure_correct_user
    @post_image = PostImage.find(params[:id])
---
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def search
    @tag_list = Tag.all  #こっちの投稿一覧表示ページでも全てのタグを表示するために、タグを全取得
    @tag = Tag.find(params[:tag_id])  #クリックしたタグを取得
    @post_images = @tag.post_images.all           #クリックしたタグに紐付けられた投稿を全て表示
---
SELECT "tags".* FROM "tags"
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]