app/controllers/users/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."user_id" = ? ORDER BY "post_images"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 25], ["OFFSET", 0]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "tags".* FROM "tags"
---
  def show
    @user = User.find(params[:id])
    @post_image = PostImage.new
    @post_images = @user.post_images.page(params[:page]).reverse_order
    @tag_list = Tag.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def following
    @user = User.find(params[:id])
    @users = @user.followings
    @followings = @user.followings.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def followers
    @user = User.find(params[:id])
    @users = @user.followers
    @followers = @user.followers.all