app/views/users/post_images/_index.html.erb

              <strong><i class="far fa-flag"></i><span> <%= post_image.title %></span></strong>
               <p><%= link_to "#{post_image.post_comments.count} コメント", post_image_path(post_image.id) %></p>
---
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 3]]